"""command: .kk By @Grandpaa_please """


import random

from telethon import events


@bot.on(events.NewMessage(pattern=r"\.(.*)", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    if input_str == "الاوامر":
        r = random.randint(0, 3)
        logger.debug(r)
        if r == 0:
            await event.edit(
                "**ههلااو كلبي💞 اضغط ع الامر للنسخ**\n\n `.ترحيب` \n\n `.مسح ترحيب` \n\n `.لسته ترحيب` \n\n `.حظر` \n\n`.الغاء حظر` \n\n `.المحظورين` \n\n `.كتم` \n\n `.الغاء كتم` \n\n `.رفع القيود` \n\n `.تثبيت` \n\n `.الغاء تثبيت` \n\n `.الغاء تثبيت الكل` \n\n\n `.تنظيف`  》》 يستخدم بالرد على الرساله \n\n `.نسخ`  》》لنسخ،صوره،اسم،نبذه \n\n `.اعاده` 》》ترجع الاسم ... الخ \n\n `.اعادة التشغيل` \n\n `.ايقاف التشغيل` \n\n `.سليب` 》مثلا `.سليب 5` الرقم بلثواني \n\n `.تحديث`  》 لتحديث السورس \n\n `.بحث` 》 مثلا  `.بحث عشك` \n\n `.صوره` 》 مثلا  .صوره طياره \n\n `.ايدي` 》 لعرض معلومات البوت \n\n `.بنك`  》 يعرض البنك \n\n `.سرعه النت` 》 قياس سرعه النت \n\n `.ترجمه ar` \n\n `.ترجمه en`  \n\n `.تكرار`+الرقم + الكلمه \n\n `.سبام`  》 كذالك نفس التكرار \n\n `.سماح` 》الامر فقط لميزه  حمايه الخاص \n\n `.رفض` 》 كذالك \n\n `.الكل` 》 لرفض الكل وتشغيل الحمايه \n\n `.بلوك` 》 من الخاص \n\n `.رفع الحظر` 》》لرفع الحظر من الخاص  \n\n `.المسموح لهم` 》لعرض قائمه السماح \n\n `.كشف` 》 معلومات المتخدم \n\n `.الايدي` \n\n `.معلومات الكروب` \n\n`.معلومات الحساب` \n\n `.رابط الحساب` \n\n `.مغادره` 》 تستخدم  لمغادره الكروب \n\n `.تاك` 》 لعمل تاك للكل \n\n `.للكل` + الكلام 》 لعمل تاك \n\n `.تلكراف ميديا` 》 يستخدم بالرد على الصوره \n\n `.تلكراف نص` 》 بالرد على الكتابه"
            )
        else:
            await event.edit(
                "**ههلااو كلبي💞 اضغط ع الامر للنسخ**\n\n `.ترحيب` \n\n `.مسح ترحيب` \n\n `.لسته ترحيب` \n\n `.حظر` \n\n`.الغاء حظر` \n\n `.المحظورين` \n\n `.كتم` \n\n `.الغاء كتم` \n\n `.رفع القيود` \n\n `.تثبيت` \n\n `.الغاء تثبيت` \n\n `.الغاء تثبيت الكل` \n `.تنظيف`  》》 يستخدم بالرد على الرساله \n\n `.نسخ`  》》لنسخ،صوره،اسم،نبذه \n\n `.اعاده` 》》ترجع الاسم ... الخ \n\n `.اعادة التشغيل` \n\n `.ايقاف التشغيل` \n\n `.سليب` 》مثلا `.سليب 5` الرقم بلثواني \n\n `.تحديث`  》 لتحديث السورس \n\n `.بحث` 》 مثلا  `.بحث عشك` \n\n `.صوره` 》 مثلا  .صوره طياره \n\n `.ايدي` 》معلومات البوت \n\n `.بنك`  》 يعرض البنك \n\n `.سرعه النت` 》 قياس سرعه النت \n\n `.ترجمه ar` \n\n `.ترجمه en`  \n\n `تكرار`+الرقم + الكلمه \n\n `.سبام`  》 كذالك نفس التكرار \n\n `.سماح` 》الامر فقط لميزه  حمايه الخاص \n\n `.رفض` 》 كذالك \n\n `.الكل` 》 لرفض الكل وتشغيل الحمايه \n\n `.بلوك` 》 من الخاص \n\n `.رفع الحظر` 》》لرفع الحظر من الخاص  \n\n `.المسموح لهم` 》لعرض قائمه السماح \n\n `.كشف` 》 معلومات المتخدم \n\n `.الايدي` \n\n `.معلومات الكروب` \n\n `.رابط الحساب` \n\n `.مغادره` 》 تستخدم  لمغادره الكروب \n\n `.تاك` 》 لعمل تاك للكل \n\n `.للكل` + الكلام 》 لعمل تاك \n\n `.تلكراف ميديا` 》 يستخدم بالرد على الصوره \n\n `.تلكراف نص` 》 بالرد على الكتابه"
            )


@bot.on(events.NewMessage(pattern=r"\.(.*)", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    if input_str == "اوامر التحشيش":
        r = random.randint(0, 3)
        logger.debug(r)
        if r == 0:
            await event.edit(
                " **ههلااو كلبي💞اضغط ع الامر للنسخ** \n\n`.قمر` \n\n`.اقمار`\n\n`.قمور`\n\n`.نظام شمسي`\n\n`.غبي`\n\n`.تنويم`\n\n`.حلويات`\n\n`.ساعه`\n\n`.رياضه`\n\n`.الارض`\n\n`.نجمه`\n\n`.مربعات`\n\n`.مطر`\n\n`.احبك`\n\n`.شرطه`\n\n`.دائره`\n\n`.انمي`\n\n`.قرد`\n\n`.ايد`\n\n`.قتل`\n\n`.قنابل`\n\n`.قلب`\n\n`.قلبي`\n\n`.قلوب`\n\n`.حزين`\n\n`.محح`\n\n`.تفكير`\n\n`.تهكير`"
            )
        else:
            await event.edit(
                "**ههلااو كلبي💞اضغط ع الامر للنسخ** \n\n`.قمر` \n\n`.اقمار`\n\n`.قمور`\n\n`.نظام شمسي`\n\n`.غبي`\n\n`.تنويم`\n\n`.حلويات`\n\n`.ساعه`\n\n`.رياضه`\n\n`.الارض`\n\n`.نجمه`\n\n`.مربعات`\n\n`.مطر`\n\n`.احبك`\n\n`.شرطه`\n\n`.دائره`\n\n`.انمي`\n\n`.قرد`\n\n`.ايد`\n\n`.قتل`\n\n`.قنابل`\n\n`.قلب`\n\n`.قلبي`\n\n`.قلوب`\n\n`.حزين`\n\n`.محح`\n\n`.تفكير`\n\n`.تهكير`"
            )


@bot.on(events.NewMessage(pattern=r"\.(.*)", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    if input_str == "بيكا":
        r = random.randint(0, 3)
        logger.debug(r)
        if r == 0:
            await event.edit("بيكا بيكااا ")
        else:
            await event.edit("بيكا بيكااا ")
