"""command: .kk By @Grandpaa_please """


import random

from telethon import events


@bot.on(events.NewMessage(pattern=r"\.(.*)", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    if input_str == "الاوامر":
        r = random.randint(0, 3)
        logger.debug(r)
        if r == 0:
            await event.edit(
                "**ههلااو كلبي💞 اضغط ع الامر للنسخ**\n\n.ترحيبn\.مسح ترحيبn\.لسته ترحيب n\.حظرn\.الغاء حظر n\.المحظورينn\.كتمn\.الغاء كتمn\.رفع القيودn\.تثبيتn\.الغاء تثبيت n\ .الغاء تثبيت الكل n\n\ .تنظيف 》》 يستخدم بالرد على الرسالهn\n\ .نسخ 》》لنسخ،صوره،اسم،نبذهn\n\.اعاده》》ترجع الاسم ... الخn\n\.اعادة التشغيلn\.ايقاف التشغيل n\.سليب 》مثلا .سليب 5 الرقم بلثوانيn\.تحديث 》 لتحديث السورسn\.بحث》 مثلا  .بحث عشك n\.صوره》 مثلا  .صوره طيارهn\.ايدي 》معلومات البوت n\ .بنك 》 يعرض البنك n\.سرعه النت 》 قياس سرعه النتn\.ترجمه arn\.ترجمه en  n\تكرار+الرقم + الكلمهn\.سبام 》 كذالك نفس التكرارn\.سماح》الامر فقط لميزه  حمايه الخاص n\ .رفض 》 كذالك n\.الكل 》 لرفض الكل وتشغيل الحمايهn\.بلوك》 من الخاصn\.رفع الحظر》》لرفع الحظر من الخاصn\.المسموح لهم》لعرض قائمه السماحn\.كشف 》 معلومات المتخدمn\.الايديn\.معلومات الكروب n\.رابط الحسابn\.مغادره》 تستخدم  لمغادره الكروبn\.تاك》 لعمل تاك للكل n\ .للكل + الكلام 》 لعمل تاك n\.تلكراف ميديا 》 يستخدم بالرد على الصوره n\ .تلكراف نص 》 بالرد على الكتابه"
            )
        else:
            await event.edit(
                "**ههلااو كلبي💞 اضغط ع الامر للنسخ**\n\n.ترحيبn\.مسح ترحيبn\.لسته ترحيب n\.حظرn\.الغاء حظر n\.المحظورينn\.كتمn\.الغاء كتمn\.رفع القيودn\.تثبيتn\.الغاء تثبيت n\ .الغاء تثبيت الكل n\n\ .تنظيف 》》 يستخدم بالرد على الرسالهn\n\ .نسخ 》》لنسخ،صوره،اسم،نبذهn\n\.اعاده》》ترجع الاسم ... الخn\n\.اعادة التشغيلn\.ايقاف التشغيل n\.سليب 》مثلا .سليب 5 الرقم بلثوانيn\.تحديث 》 لتحديث السورسn\.بحث》 مثلا  .بحث عشك n\.صوره》 مثلا  .صوره طيارهn\.ايدي 》معلومات البوت n\ .بنك 》 يعرض البنك n\.سرعه النت 》 قياس سرعه النتn\.ترجمه arn\.ترجمه en  n\تكرار+الرقم + الكلمهn\.سبام 》 كذالك نفس التكرارn\.سماح》الامر فقط لميزه  حمايه الخاص n\ .رفض 》 كذالك n\.الكل 》 لرفض الكل وتشغيل الحمايهn\.بلوك》 من الخاصn\.رفع الحظر》》لرفع الحظر من الخاصn\.المسموح لهم》لعرض قائمه السماحn\.كشف 》 معلومات المتخدمn\.الايديn\.معلومات الكروب n\.رابط الحسابn\.مغادره》 تستخدم  لمغادره الكروبn\.تاك》 لعمل تاك للكل n\ .للكل + الكلام 》 لعمل تاك n\.تلكراف ميديا 》 يستخدم بالرد على الصوره n\ .تلكراف نص 》 بالرد على الكتابه"
            )


@bot.on(events.NewMessage(pattern=r"\.(.*)", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    if input_str == "اوامر التحشيش":
        r = random.randint(0, 3)
        logger.debug(r)
        if r == 0:
            await event.edit(
                " **ههلااو كلبي💞اضغط ع الامر للنسخ** \n\n`.قمر` \n\n`.اقمار`\n\n`.قمور`\n\n`.نظام شمسي`\n\n`.غبي`\n\n`.تنويم`\n\n`.حلويات`\n\n`.ساعه`\n\n`.رياضه`\n\n`.الارض`\n\n`.نجمه`\n\n`.مربعات`\n\n`.مطر`\n\n`.احبك`\n\n`.شرطه`\n\n`.دائره`\n\n`.انمي`\n\n`.قرد`\n\n`.ايد`\n\n`.قتل`\n\n`.قنابل`\n\n`.قلب`\n\n`.قلبي`\n\n`.قلوب`\n\n`.حزين`\n\n`.محح`\n\n`.تفكير`\n\n`.تهكير`"
            )
        else:
            await event.edit(
                "**ههلااو كلبي💞اضغط ع الامر للنسخ** \n\n`.قمر` \n\n`.اقمار`\n\n`.قمور`\n\n`.نظام شمسي`\n\n`.غبي`\n\n`.تنويم`\n\n`.حلويات`\n\n`.ساعه`\n\n`.رياضه`\n\n`.الارض`\n\n`.نجمه`\n\n`.مربعات`\n\n`.مطر`\n\n`.احبك`\n\n`.شرطه`\n\n`.دائره`\n\n`.انمي`\n\n`.قرد`\n\n`.ايد`\n\n`.قتل`\n\n`.قنابل`\n\n`.قلب`\n\n`.قلبي`\n\n`.قلوب`\n\n`.حزين`\n\n`.محح`\n\n`.تفكير`\n\n`.تهكير`"
            )


@bot.on(events.NewMessage(pattern=r"\.(.*)", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    if input_str == "بيكا":
        r = random.randint(0, 3)
        logger.debug(r)
        if r == 0:
            await event.edit("بيكا بيكااا ")
        else:
            await event.edit("بيكا بيكااا ")
